app/controllers/school_classes_controller.rb

    def index #list of drinks
        @school_class = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"

    def show #individual record. one drink for ex
        @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create #save new record when clicked submit on "new"
        @school_class = SchoolClass.new(allowed_params)

        if @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sda"], ["room_number", 33], ["created_at", "2020-02-24 12:46:41.776758"], ["updated_at", "2020-02-24 12:46:41.776758"]]

    def edit #display form for the existing record
        @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update #update the existing modified record
        @school_class = SchoolClass.find(params[:id])

        if @school_class.update_attributes(allowed_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 9], ["updated_at", "2020-02-24 13:00:29.032329"], ["id", 1]]

    def destroy
        @school_class = SchoolClass.find(params[:id])
        @school_class.destroy
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 3]]