app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Mustafa2"], ["last_name", "yea babay"], ["created_at", "2020-02-24 13:12:02.449168"], ["updated_at", "2020-02-24 13:12:02.449168"]]
---
 def create
@student = Student.create(allowed_params)

UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Mohamed 2"], ["updated_at", "2020-02-24 13:13:52.584343"], ["id", 1]]
---
 def update
  @student.update(allowed_params)